In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one -2.307227  0.615800
1    a  two  1.389073  1.046661
2    b  one -0.003462  0.137290
3    b  two -0.065353 -0.776439
4    a  one -0.195139 -0.028649

In [2]:
df['data1'].groupby(by=df['key1']).sum()

key1
a   -1.113293
b   -0.068815
Name: data1, dtype: float64

In [5]:
df['data1'].groupby([df['key1'],df['key2']]).mean().unstack()

key2       one       two
key1
a    -1.251183  1.389073
b    -0.003462 -0.065353

In [6]:
#DataFrameGroupby
df.groupby(by=['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.251183  0.293576
     two   1.389073  1.046661
b    one  -0.003462  0.137290
     two  -0.065353 -0.776439

In [9]:
##SeriesGroupBy
df.groupby(by=['key1','key2'])['data1'].mean()

key1  key2
a     one    -1.251183
      two     1.389073
b     one    -0.003462
      two    -0.065353
Name: data1, dtype: float64